'''
23. セクション構造Permalink
記事中に含まれるセクション名とそのレベル（例えば”== セクション名 ==”なら1）を表示せよ．
'''
import json
import re

def extract_uk():
    with open('jawiki-country.json') as file:
        for line in file:
            line_dict = json.loads(line)
            if line_dict['title'] == 'イギリス':
                text = line_dict['text']
            else: pass

    return text

def main():
    pattern = re.compile(r'''
        ^
        (=+)    # キャプチャ1
        \s*     # 空白文字:\sが0個以上
        (.+?)   # セクション名, キャプチャ2, 非貪欲
        \s*
        \1      # キャプチャ1と同じ文字列を参照する
        $
        ''', re.MULTILINE + re.VERBOSE)

    li = pattern.findall(extract_uk())
    #レベルの基準（＝＝をレベル1, ===レベル2, ====をレベル3）を'='の長さで設定
    regulation = len(li[0][0])
    for line in li:
        for i in range(len(line[0]) - regulation):
            print('\t', end = '')
        print(line[1] + ' ' + 'level : ' + str(len(line[0]) - 1))

if __name__ == "__main__":
    main()

'''liの中身
[('==', '国名'), ('==', '歴史'), ('==', '地理'), ('===', '主要都市'), 
('===', '気候'), ('==', '政治'), ('===', '元首'), ('===', '法'), 
('===', '内政'), ('===', '地方行政区分'), ('===', '外交・軍事'), 
('==', '経済'), ('===', '鉱業'), ('===', '農業'), ('===', '貿易'),
('===', '不動産'), ('===', 'エネルギー政策'), ('===', '通貨'), 
('===', '企業'), ('====', '通信'), ('==', '交通'), ('===', '道路'), 
('===', '鉄道'), ('===', '海運'), ('===', '航空'), ('==', '科学技術'), 
('==', '国民'), ('===', '言語'), ('===', '宗教'), ('===', '婚姻'), 
('===', '移住'), ('===', '教育'), ('===', '医療'), ('==', '文化'), 
('===', '食文化'), ('===', '文学'), ('===', '哲学'), ('===', '音楽'), 
('====', 'ポピュラー音楽'), ('===', '映画'), ('===', 'コメディ'), ('===', '国花'), 
('===', '世界遺産'), ('===', '祝祭日'), ('===', 'スポーツ'), ('====', 'サッカー'), 
('====', 'クリケット'), ('====', '競馬'), ('====', 'モータースポーツ'), 
('====', '野球'), ('====', 'カーリング'), ('====', '自転車競技'), ('==', '脚注'), 
('==', '関連項目'), ('==', '外部リンク')]
'''